# FinishInitializationEO Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
DocumentEntryPoint..::..FinishInitializationEO Method
DocumentEntryPoint Class See Also
---
For Revit Macros internal use only.
**Namespace:** Autodesk.Revit.UI.Macros**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void FinishInitializationEO()
```

Visual Basic
---
```text
Public Sub FinishInitializationEO
```

Visual C++
---
```text
public:
virtual void FinishInitializationEO() sealed
```

# ### Implements
IEntryPoint..::..FinishInitialization()()()()
# See Also
DocumentEntryPoint Class
Autodesk.Revit.UI.Macros Namespace